src/main/resources/xml/mtn-stop-ussd-notification.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:loc="http://www.csapi.org/schema/osg/ussd/notification_manager/v1_0/local">
    <soapenv:Header>
        <tns:RequestSOAPHeader xmlns:tns="http://www.huawei.com.cn/schema/common/v2_1">
            <tns:spId>sp_id</tns:spId>
            <tns:spPassword>sp_password</tns:spPassword>
            <tns:serviceId>service_id</tns:serviceId>
            <tns:timeStamp>time_stamp</tns:timeStamp>
        </tns:RequestSOAPHeader>
    </soapenv:Header>
    <soapenv:Body>
        <loc:stopUSSDNotification>
            <loc:correlator>correlator_ref</loc:correlator>
        </loc:stopUSSDNotification>
    </soapenv:Body>
</soapenv:Envelope>

